* #上海疫情
* 2022 上海疫情数据

#+NANE: total
| 分类 |   累计 |  确诊 | 无症状 | 死亡 | 感染率/% | 日期                 |
|------+--------+-------+--------+------+----------+----------------------|
| 总计 | 397942 | 27613 | 370329 |   10 |     1.60 | 截止 2022-04-19 0 点 |
| 4 月 | 361294 | 26068 | 335226 |   10 |          | 截止 2022-04-19 0 点 |
| 3 月 |  36641 |  1545 |  35096 |      |          | 截止 2022-03-31      |
| 2 月 |      7 |     0 |      7 |      |          | 截止 2022-02-28      |
#+TBLFM: @5$3=remote(d2, @2$4) + remote(d2, @2$5) + remote(d2, @2$6) + remote(d2, @2$7) + remote(d2, @2$8) + remote(d2, @2$9)
#+TBLFM: @5$4=remote(d2, @3$4) + remote(d2, @3$5) + remote(d2, @3$6) + remote(d2, @3$7) + remote(d2, @3$8) + remote(d2, @3$9)
#+TBLFM: @5$2=@5$3+@5$4
#+TBLFM: @4$3=remote(d3, @8$2) + remote(d3, @8$3) + remote(d3, @8$4) + remote(d3, @8$5) + remote(d3, @8$6)+ remote(d3, @8$7)+ remote(d3, @8$8)+ remote(d3, @8$9)+ remote(d3, @8$10) + remote(d3, @8$11) + remote(d3, @8$12) + remote(d3, @5$2) + remote(d3, @5$3) + remote(d3, @5$4) + remote(d3, @5$5) + remote(d3, @5$6)+ remote(d3, @5$7)+ remote(d3, @5$8)+ remote(d3, @5$9)+ remote(d3, @5$10)+ remote(d3, @5$11) + remote(d3, @2$2) + remote(d3, @2$3) + remote(d3, @2$4) + remote(d3, @2$5) + remote(d3, @2$6)+ remote(d3, @2$7)+ remote(d3, @2$8)+ remote(d3, @2$9)+ remote(d3, @2$10)+ remote(d3, @2$11)
#+TBLFM: @4$4=remote(d3, @3$2) + remote(d3, @3$3) + remote(d3, @3$4) + remote(d3, @3$5) + remote(d3, @3$6)+ remote(d3, @3$7)+ remote(d3, @3$8)+ remote(d3, @3$9)+ remote(d3, @3$10) + remote(d3, @3$11) + remote(d3, @6$2) + remote(d3, @6$3) + remote(d3, @6$4) + remote(d3, @6$5) + remote(d3, @6$6)+ remote(d3, @6$7)+ remote(d3, @6$8)+ remote(d3, @6$9)+ remote(d3, @6$10) + remote(d3, @6$11) + remote(d3, @9$2) + remote(d3, @9$3) + remote(d3, @9$4) + remote(d3, @9$5) + remote(d3, @9$6)+ remote(d3, @9$7)+ remote(d3, @9$8)+ remote(d3, @9$9)+ remote(d3, @9$10) + remote(d3, @9$11) + remote(d3, @9$12)
#+TBLFM: @4$2=@4$3+@4$4
#+TBLFM: @3$3=remote(d4, @5$9) + remote(d4, @5$8) + remote(d4, @5$7) + remote(d4, @5$6) + remote(d4, @5$5) + remote(d4, @5$4) + remote(d4, @5$3) + remote(d4, @5$2) + remote(d4, @2$2) + remote(d4, @2$3) + remote(d4, @2$4) + remote(d4, @2$5) + remote(d4, @2$6)+ remote(d4, @2$7)+ remote(d4, @2$8)+ remote(d4, @2$9)+ remote(d4, @2$10) + remote(d4, @2$11)
#+TBLFM: @3$4=remote(d4, @6$9) + remote(d4, @6$8) + remote(d4, @6$7) + remote(d4, @6$6) + remote(d4, @6$5) + remote(d4, @6$4) + remote(d4, @6$3) + remote(d4, @6$2) + remote(d4, @3$2) + remote(d4, @3$3) + remote(d4, @3$4) + remote(d4, @3$5) + remote(d4, @3$6)+ remote(d4, @3$7)+ remote(d4, @3$8)+ remote(d4, @3$9)+ remote(d4, @3$10) + remote(d4, @3$11)
#+TBLFM: @3$5=remote(d4, @7$9) + remote(d4, @7$8)
#+TBLFM: @3$2=@3$3+@3$4
#+TBLFM: @2$2..@2$5=vsum(@3..@>);f2
#+TBLFM: @2$6=@2$2*100/24870895;f2
#+TBLFM: @2$7='(concat "截止 " (format-time-string "%Y-%m-%d") " 0 点");N
#+TBLFM: @3$7='(concat "截止 " (format-time-string "%Y-%m-%d") " 0 点");N

#+NAME: d2
| 2 月   | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 |
|--------+----+----+----+----+----+----+----+----|
| 确诊   |    |    |  0 |  0 |  0 |  0 |  0 |  0 |
| 无症状 |    |    |  0 |  1 |  1 |  1 |  1 |  3 |

#+NAME: d3
| 3 月   |   1 |   2 |   3 |    4 |    5 |    6 |    7 |    8 |    9 |   10 |      |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |   1 |   3 |   2 |    3 |    0 |    3 |    4 |    3 |    4 |   11 |      |
| 无症状 |   1 |   5 |  14 |   16 |   28 |   45 |   51 |   62 |   76 |   64 |      |
| 3 月   |  11 |  12 |  13 |   14 |   15 |   16 |   17 |   18 |   19 |   20 |      |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |   5 |   1 |  41 |    9 |    5 |    8 |   57 |    8 |   17 |   24 |      |
| 无症状 |  78 |  64 | 128 |  130 |  197 |  150 |  203 |  366 |  492 |  734 |      |
| 3 月   |  21 |  22 |  23 |   24 |   25 |   26 |   27 |   28 |   29 |   30 |   31 |
|--------+-----+-----+-----+------+------+------+------+------+------+------+------|
| 确诊   |  31 |   4 |   4 |   29 |   38 |   45 |   50 |   96 |  326 |  355 |  358 |
| 无症状 | 865 | 977 | 979 | 1580 | 2231 | 2631 | 3450 | 4381 | 5656 | 5298 | 4144 |

#+NAME: d4
| 4 月   |     1 |     2 |     3 |     4 |     5 |     6 |     7 |     8 |     9 |    10 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |   260 |   438 |   425 |   268 |   311 |   322 |   824 |  1015 |  1006 |   914 |
| 无症状 |  6051 |  7788 |  8541 | 13086 | 16766 | 19660 | 20398 | 22609 | 23979 | 25173 |
| 4 月   |    11 |    12 |    13 |    14 |    15 |    16 |    17 |    18 |    19 |    20 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |   994 |  1189 |  2573 |  3200 |  3590 |  3238 |  2417 |  3084 |       |       |
| 无症状 | 22348 | 25141 | 25146 | 19872 | 19923 | 21582 | 19831 | 17332 |       |       |
| 死亡   |       |       |       |       |       |       |     3 |     7 |       |       |
| 4 月   |    21 |    22 |    23 |    24 |    25 |    26 |    27 |    28 |    29 |    30 |
|--------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
| 确诊   |       |       |       |       |       |       |       |       |       |       |
| 无症状 |       |       |       |       |       |       |       |       |       |       |
